tutorial.backup/pilotedDiffusionFlame/les/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 50;

boundaryField
{
    AXIS
    {
        type            empty;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    COFLOW
    {
        type            fixedValue;
        value           uniform 10;
    }
    PILOT
    {
        type            fixedValue;
        value           uniform 10;
    }
    FUEL
    {
        type            fixedValue;
        value           uniform 50;
    }
    WALL
    {
        type            compressible::epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 50;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
